[x, y] = meshgrid(-5:0.5:5);
u = x-4.*sin(y);
v = y+4.*sin(x);

quiver(x,y,u,v,'g');
axis([-5,5,-5,5]);


a=[-5,-4, -3, -2, -1,1,2,3,4,0,0,0,0,0,0,0,0,0];
b = [0,0,0,0,0,0,0,0,0,-4,-3,-2,-1,1,2,3,4,5];

% фазов портрет
hold on

    [t,x] = ode45(@solver, [0,-4], [2,0]); 
    plot(x(:,1), x(:,2), 'g');
for k = 1:length(a)
    [t,x]=ode45(@solver, [0,4], [a(k), b(k)]);
    plot(x(:,1), x(:,2), 'r'); 
    [t,x] = ode45(@solver, [0,-4], [a(k), b(k)]); 
    plot(x(:,1), x(:,2), 'b');

end
axis([-5,5,-5,5]);